{
  "content": "**In 74 days, Joe Biden will be the President of the United States. It’s official (_finally_).**\n\nBut it feels bittersweet. 70 million people still voted for Donald Trump. I hoped for a firm rejection of Trumpism and a “fuck you, you fascist fuck” landslide. I hoped that a worsening climate crisis, COVID-19 pandemic, and economic recession would be enough for voters to wake up. But no. Racism nearly won again. In this moment of near national collapse, 47% of Americans still clung to their unapologetic white supremacist President. They lost—but this narrow margin still cuts deep. As a Black, queer woman—it hurts. I had a bit of faith in my country this time around, to cast a ballot that says: I matter. Once again, I am disappointed.\n\n**But not in us**. We worked our asses off and carried more than our fair share this election ([**see our long list of achievements**](https://www.sunrisemovement.org/press-releases/sunrise-movements-general-election-impact/)) because even if nearly half the country won’t say it, we will: we matter.\n\nThere is a long fight ahead of us to abolish and rebuild the systems that do not think we matter. But over the next decade, we will align America’s moral compass and point it toward the common good of all people: justice, equity, and science.\n\nWe will point ourselves toward the decade of the Green New Deal. Today is Day Zero.\n\nMovements won this election for Joe Biden. Sunrise and other grassroots community organizations understood the stakes, put our differences aside, and mobilized our political power machine for climate, economic, immigration, and racial justice. We organized hard, contacted millions of voters, and cast the [**deciding ballots**](https://www.theguardian.com/us-news/2020/nov/05/black-voters-wisconsin-joe-biden) in critical areas for this election.  \n\nIn particular, [**Joe Biden has young voters of color to thank**](https://circle.tufts.edu/latest-research/election-week-2020). We turned out to vote in record highs—the highest in history—but not for him. We voted to save ourselves. We are fighting for existential survival on three fronts: the climate crisis, COVID-19, and white supremacy. And we cast our ballot only to vote out an openly racist administration that is especially hellbent on the destruction of our people and planet. The American system, by design, works to oppress our voice and exploit our bodies. We do not expect Joe Biden to fix it. We expect him to stand aside and allow us to fix it. Biden owes his victory and his administration to us. And we will not let him forget it.\n\nDuring the election cycle, we pushed Biden as far as possible. In his $2 trillion “[**Build Back Better Plan**](https://joebiden.com/build-back-better/)” we won some important commitments: 100% clean energy by 2035, big investment in frontline communities, and the creation of 10 million or more new jobs.\n\nWe backed Biden’s plan for the sake of defeating Trump. But it’s time for his Green New Deal Jr. to grow up. Some key pieces are missing: end fracking and just transition for fossil fuel workers and communities. We went backwards on climate under Trump, so we need to take some extra steps forward to make up for lost time. [**And fast.**](https://time.com/5864692/climate-change-defining-moment/) Science and justice demand a full Green New Deal. \n\nThe people demand bold and progressive climate action too. Our progressive messaging carried this win for Joe Biden, and campaigns that pandered to moderate and centrist voters lost. See: Amy McGrath in Kentucky. Progressive candidates with Green New Deal platforms won big across the board. [**The Squad grew**](https://www.vox.com/2020/11/4/21538719/cori-bush-ritchie-torres-jamaal-bowman-election-results) this election, but our majority in the House of Representatives shrunk.\n\nFlorida is a perfect example. We lost there by a 4% margin, but an overwhelming majority passed a [**$15 state minimum wage**](https://www.theguardian.com/business/commentisfree/2020/nov/08/biden-lost-florida-but-he-helped-raise-the-minimum-wage-there-policy-matters). _Floridians voted **for** progressive policy and **against** a centrist candidate_. The Democratic party ignored that winning populist, leftist energy, stubbornly stuck to their old playbook, and lost the state. Look at [**Fair Fight and New Georgia Project**](https://abcnews.go.com/Politics/eyes-stacey-abrams-joe-biden-passes-donald-trump/story?id=74039207), or Arizona’s [**LUCHA**](https://www.motherjones.com/2020-elections/2020/09/arizona-election-trump-mcsally-kelly-arpaio-sb-1070/). These organizations invested in progressive, long-term community organizing, rooted in the needs of working people and aimed at deep structural change. _They_ flipped their states, not the Democratic party.\n\nCentrism won’t solve systemic racism, unprecedented economic inequality, and existential climate collapse. People know it, and that’s how they voted. They voted for something visionary and different—on the left and right.\n\nRead the room Pelosi and Perez, Feinstein and Schumer. People do not want status quo centrism. You nearly cost us the election but we won it back, and we will never listen to you again. You’ve proven you are out of touch with modern politics and it’s time to pass the torch to the next generation of the party.\n\nAnd we are going big and bold and progressive.\n\nI will be honest—it will be difficult to push through the big, structural changes required for our vision of a Green New Deal without a majority in the Senate. But hope isn’t lost there. We still have a good shot with these [**two run-off races**](https://www.npr.org/2020/11/07/932068951/senate-control-likely-decided-by-fate-of-2-georgia-runoff-races) in a freshly blue Georgia. Over the next few weeks, we have to throw all our movement energy behind Reverend Warnock and John Ossoff and try to flip the Senate. \n\nI’m going to Georgia to knock doors, and I know I’ll be seeing some of you there too.\n\nAnd, even without the Senate, Biden has a clear path for immediate climate action and the mandate of the people to lay the foundation for the Green New Deal.\n\n**We have a long list for President Biden on Day One**. I hope he plans on a working lunch:\n\n* Establish an Office of Climate Mobilization and appoint a director that reports directly to the President to coordinate an all-government mobilization to confront the crisis, just like we mobilized to address the existential threat of Nazi Germany in WWII.  \n* Appoint a Climate Cabinet that would work with the Climate Mobilization Director to ensure that every agency — Treasury, Labor, Energy, Transportation, Agriculture, and more — is working towards a Green New Deal\n* Declare a climate emergency, and mobilize the full powers of the federal government to combat the crisis, including new standards for clean electricity, vehicles, and buildings, and putting government spending to work towards a clean energy economy.\n* Take action on environmental justice at home and abroad by re-establishing and  strengthening environmental justice laws and re-entering the Paris Climate Agreement \n* Stop digging the hole deeper by ending fossil fuel leasing on public lands and waters and refusing to subsidize or bail out fossil fuel polluters. Revoke permits for Keystone XL Pipelines and shut down the Dakota Access Pipeline. \n* Establish a climate test to ensure that no new infrastructure is built that would worsen the climate crisis \n* Advance Indigenous sovereignty and ensure free, prior and informed consent for Indigenous peoples for all decisions that affect them and their traditional territories\n* Instruct the Department of Justice to prosecute the fossil fuel executives that knowingly caused the climate crisis and inflicted intentional harm.\n\n(And this is the just short version of our list.)\n\nOn _Day One_, he can start our decade of the Green New Deal. The people’s mandate demands it. He said so himself in a [**speech on Friday.**](https://www.newsweek.com/joe-biden-says-hes-going-win-mandate-action-racism-climate-covid-1545687)\n\nWe elected him, he represents us, and now we have to make sure he delivers on his promise to be a President to all people—including those long forgotten and neglected by the system. We will hold him to it. **To use his** [**own words**](https://www.politico.com/f/?id=00000175-5a8f-dc88-a97f-fadf50c50000&nname=playbook&nid=0000014f-1646-d88f-a1cf-5f46b7bd0000&nrid=0000014e-f0fa-dd93-ad7f-f8ff3be90002&nlid=630318)**: climate is a “moral obligation” and it is the “number one issue to face humanity.”**\n\nWe will make sure he remembers that we sacrificed our youth to fight for this planet. That we have other dreams besides climate organizing and activism. We’re trapped, unable do anything else with this carbon clock ticking in our ears, water rising past our knees, heat searing the back of our necks—it’s too fucking hot. Joe Biden needs to feel that heat too.\n\nSo now it’s time for our movement to do what it does best: Organize. Recruit. Train. Act. We continue to build up the most powerful political machine in American politics. Young people of color won this election—and young people of color will make this movement stronger. This isn’t just the white climate kids’ movement anymore—this is an intersectional movement for justice. Racial justice, economic justice, immigration justice—it’s all climate justice. And in our decade of the Green New Deal, justice will be front and center.\n\nWe need to organize and pressure Biden with all our might to make sure justice is his priority, too. \n\nAnd that’s just until 2022. The [**midterm Senate map**](https://www.rollcall.com/2020/11/05/dont-look-now-the-fight-for-the-senate-continues-into-2022/) is heavily in our favor. We can win big and pack a Senate with Green New Deal champions. And we will. We could have done it this year, but the party elites scoffed at progressivism. They chided us to be patient and trust that moderate centrist candidates would unify the country.\n\nPredictably, they were wrong. Over 70 million Trump votes. Six House seats lost. A Senate majority hinging on Georgia run-off election miracles. \n\nThe Democratic party failed us and nearly cost us our future. If not for the movements who mobilized despite them, Trump may have won. The old, corporate Democrats are done. The writing is on the wall.\n\n**This is our party now.**",
  "title": "Lmao This is the Title",
  "subtitle": "Lmao this is the Subtitle",
  "image": {
    "alt": "Image",
    "fit": "cover",
    "path": "/images/placeholder.svg",
    "x": "center",
    "y": "center"
  },
  "tags": [
    "Featured",
    "Movement Updates"
  ],
  "author": "Firstname Lastname",
  "published": "2021-01-16T03:57:34.291Z"
}
